modules/Vendor/ModuleProvider.php

select count(*) as aggregate from `users` inner join `vendor_referral` on `users`.`id` = `vendor_referral`.`user_id` where `users`.`id` = 1 and `users`.`deleted_at` is null
---
            ];
        }

        $is_vendor = User::join('vendor_referral', 'users.id', 'vendor_referral.user_id')
                ->where('users.id', $user->id)
                ->count();