modules/User/Controllers/Auth/RegisterController.php

insert into `users` (`first_name`, `last_name`, `email`, `password`, `status`, `phone`, `name`, `updated_at`, `created_at`) values ('Cipta', 'yyy', 'cipta@me.com', '$2y$10$F8dwOX19WVyi59YRtNO5neoQmkcZFQErXx.eXilkvhwycbrzWud9.', 'publish', '081297127114', 'Cipta yyy', '2023-11-03 19:43:59', '2023-11-03 19:43:59')
---
                    ], 200);
                }
            } else {
                $user = \App\User::create([
                    'first_name' => $request->input('first_name'),
                    'last_name'  => $request->input('last_name'),
                    'email'      => $request->input('email'),
                    'password'   => Hash::make($request->input('password')),
                    'status'    => $request->input('publish','publish'),
                    'phone'    => $request->input('phone'),
                ]);