modules/Tour/Models/Tour.php

    public function getNumberServiceInLocation($location) {
        $number = 0;
        if (!empty($location)) {
            $number = parent::join('bravo_locations', function ($join) use ($location) {
                        $join->on('bravo_locations.id', '=', 'bravo_tours.location_id')->where('bravo_locations._lft', '>=', $location->_lft)->where('bravo_locations._rgt', '<=', $location->_rgt);
                    })->where("bravo_tours.status", "publish")->with(['translation'])->count("bravo_tours.id");
---
select count(`bravo_tours`.`id`) as aggregate from `bravo_tours` inner join `bravo_locations` on `bravo_locations`.`id` = `bravo_tours`.`location_id` and `bravo_locations`.`_lft` >= '63' and `bravo_locations`.`_rgt` <= '74' where `bravo_tours`.`status` = 'publish' and `bravo_tours`.`deleted_at` is null

    public function hasWishList() {
        return $this->hasOne($this->userWishListClass, 'object_id', 'id')->where('object_model', $this->type)->where('user_id', Auth::id() ?? 0);
---
select * from `user_wishlist` where `user_wishlist`.`object_id` = 34 and `user_wishlist`.`object_id` is not null and `object_model` = 'tour' and `user_id` = 1 limit 1

    public function search($request) {
        $model_Tour = parent::query()->select("bravo_tours.*");
        $model_Tour->where("bravo_tours.status", "publish");
        if (!empty($location_id = $request['location_id'] ?? "")) {
            $location = Location::where('id', $location_id)->where("status", "publish")->first();
            if (!empty($location)) {
                $model_Tour->join('bravo_locations', function ($join) use ($location) {
                    $join->on('bravo_locations.id', '=', 'bravo_tours.location_id')->where('bravo_locations._lft', '>=', $location->_lft)->where('bravo_locations._rgt', '<=', $location->_rgt);
                });
            }
        }
        if (!empty($price_range = $request['price_range'] ?? "")) {
            $pri_from = explode(";", $price_range)[0];
            $pri_to = explode(";", $price_range)[1];
            $raw_sql_min_max = "( (IFNULL(bravo_tours.sale_price,0) > 0 and bravo_tours.sale_price >= ? ) OR (IFNULL(bravo_tours.sale_price,0) <= 0 and bravo_tours.price >= ?) )
								AND ( (IFNULL(bravo_tours.sale_price,0) > 0 and bravo_tours.sale_price <= ? ) OR (IFNULL(bravo_tours.sale_price,0) <= 0 and bravo_tours.price <= ?) )";
            $model_Tour->WhereRaw($raw_sql_min_max, [
                $pri_from,
                $pri_from,
                $pri_to,
                $pri_to
            ]);
        }

        $category_ids = $request['cat_id'] ?? [];
        if (!is_array($category_ids))
            $category_ids = [$category_ids];
        $category_ids = array_filter(array_values($category_ids));
        $list_cat = TourCategory::whereIn('id', $category_ids)->where("status", "publish")->get();
---
select * from `bravo_tour_category` where `id` in ('6') and `status` = 'publish' and `bravo_tour_category`.`deleted_at` is null