app/User.php

select * from `user_meta` where (`user_id` is null and `name` = 'social_meta_avatar') limit 1
---
        public function getMeta($key, $default = '')
        {
            //if(isset($this->cachedMeta[$key])) return $this->cachedMeta[$key];

            $val = DB::table('user_meta')->where([
                'user_id' => $this->id,
                'name'    => $key
            ])->first();

select `vendor_referral`.`referral_code` from `user_upgrade_request` inner join `vendor_referral` on `user_upgrade_request`.`referral_id` = `vendor_referral`.`id` where `user_upgrade_request`.`user_id` = 1 limit 1
---
        public function userReferralCode() {
            return DB::table('user_upgrade_request')
                ->select('vendor_referral.referral_code')
                ->join('vendor_referral', 'user_upgrade_request.referral_id', 'vendor_referral.id')
                ->where('user_upgrade_request.user_id', $this->id)->first();