modules/Tour/Admin/TourController.php

select * from `bravo_tour_category` where `bravo_tour_category`.`id` in ('5', '6') and `bravo_tour_category`.`deleted_at` is null
select * from `bravo_tour_category` where `status` = 'publish' and `bravo_tour_category`.`deleted_at` is null
---
    public function index(Request $request) {
        $this->checkPermission('tour_view');
        $query = $this->tourClass::query();
        $query->orderBy('id', 'desc');
        if (!empty($tour_name = $request->input('s'))) {
            $query->where('title', 'LIKE', '%' . $tour_name . '%');
            $query->orderBy('title', 'asc');
        }
        if (!empty($cate = $request->input('cate_id'))) {
            $query->where('category_id', $cate);
        }
        if (!empty($is_featured = $request->input('is_featured'))) {
            $query->where('is_featured', 1);
        }
        if (!empty($location_id = $request->query('location_id'))) {
            $query->where('location_id', $location_id);
        }
        if ($this->hasPermission('tour_manage_others')) {
            if (!empty($author = $request->input('vendor_id'))) {
                $query->where('author_id', $author);
            }
        } else {
            $query->where('author_id', Auth::id());
        }
        $data = [
            'rows' => $query->with([
                'author',
                'category_tour'
            ])->paginate(20),
            'tour_categories' => $this->tourCategoryClass::where('status', 'publish')->get()->toTree(),
            'tour_manage_others' => $this->hasPermission('tour_manage_others'),
            'page_title' => __("Tour Management"),
            'breadcrumbs' => [
                [
                    'name' => __('Tours'),
                    'url' => route('tour.admin.index')
                ],
                [
                    'name' => __('All'),
                    'class' => 'active'
                ],
            ]
        ];

select * from `bravo_tour_category` where `status` = 'publish' and `bravo_tour_category`.`deleted_at` is null
select * from `location_category` where `status` = 'publish' and `location_category`.`deleted_at` is null
select * from `hpps` where `hpps`.`makanan_id` in (1, 2)
select `id`, `nama_makanan` from `makanans`
---
    public function edit(Request $request, $id) {
        $this->checkPermission('tour_update');
        $row = $this->tourClass::find($id);
        if (empty($row)) {
            return redirect(route('tour.admin.index'));
        }
        $translation = $row->translate($request->query('lang', get_main_lang()));
        if (!$this->hasPermission('tour_manage_others')) {
            if ($row->author_id != Auth::id()) {
                return redirect(route('tour.admin.index'));
            }
        }
        $data = [
            'row' => $row,
            'translation' => $translation,
            "selected_terms" => $row->tour_term->pluck('term_id'),
            'attributes' => $this->attributesClass::where('service', 'tour')->get(),
            'tour_category' => $this->tourCategoryClass::where('status', 'publish')->get()->toTree(),
            'tour_location' => $this->locationClass::where('status', 'publish')->get()->toTree(),
            'location_category' => $this->locationCategoryClass::where("status", "publish")->get(),
            'cogs_packages' => CogsPackage::select('id', 'nama_makanan')->with('hpp')->get(),