modules/Vendor/Controllers/TeamController.php

select * from `users` where `users`.`id` in (9) and `users`.`deleted_at` is null
select * from `vendor_team` where `vendor_team`.`vendor_id` = 9 and `vendor_team`.`vendor_id` is not null and `deleted_at` is null and `vendor_team`.`deleted_at` is null order by `created_at` desc limit 30 offset 0
select count(*) as aggregate from `vendor_team` where `vendor_team`.`vendor_id` = 9 and `vendor_team`.`vendor_id` is not null and `deleted_at` is null and `vendor_team`.`deleted_at` is null
---
    public function index()
    {
        $rows = auth()->user()->vendorTeams()->with('vendor')->where('deleted_at', null)->orderBy('created_at', 'desc')->paginate(30);